{"relevantArticles":[{"articleTitle":"操作系统之进程线程","articleAbstractText":"本文采用复习拷贝重新阅读大法 本文来自该仓库 进程与线程 1. 进程 进程是资源分配的基本单位。 进程控制块 (Process Control Block, PCB) 描述进程的基本信息和运行状态，所谓的创建进程和撤销进程，都是指 对 PCB 的操作。 一般来说,操作系统的操作中都是对于数据体的操作(似乎是废话) 下图显示了 4 个程序创建了 4 个进程，这 4 个进程可以并发地执行。 并发执行,多个程序可以在一段时间内交替运行,做到类似并行的效果 2. 线程 线程是 独立调度 的基本单位。 一个进程中可以有多个线程，它们共享进程资源。 QQ 和浏览器是两个进程，浏览器进程里面有很多线程，例如 HTTP 请求线程、事件响应线程、渲染线程等等，线程的并发执行使得在浏览器中点击一个新链接从而发起 HTTP 请求时，浏览器还可以响应用户的其它事件。 3. 进程与线程的区别 Ⅰ 拥有资源 进程是资源分配的基本单位，但是线程不拥有资源，线程可以访问隶属进程的资源。 &gt;进程拥有资源,线程不拥有,线程属于进程,所以可以访问进程的资源 Ⅱ 调度 线程是 独立调度 的基本单位，….","articleStatus":0,"articlePermalink":"/articles/2019/04/07/1561009683315.html","articleImg1URL":"https://gitee.com/CyC2018/CS-Notes/raw/master/docs/pics/a6ac2b08-3861-4e85-baa8-382287bfee9f.png"},{"articleTitle":"操作系统之内存","articleAbstractText":"本文采用复习拷贝重新阅读大法 本文来自该仓库 虚拟内存 虚拟内存的目的是为了让物理内存扩充成更大的逻辑内存，从而让程序获得更多的可用内存。 为了更好的管理内存，操作系统将内存抽象成地址空间。每个程序拥有自己的地址空间，这个地址空间被分割成多个块，每一块称为一页。这些页被映射到物理内存，但不需要映射到连续的物理内存，也不需要所有页都必须在物理内存中。当程序引用到不在物理内存中的页时，由硬件执行必要的映射，将缺失的部分装入物理内存并重新执行失败的指令。 从上面的描述中可以看出，虚拟内存允许程序不用将地址空间中的每一页都映射到物理内存，也就是说一个程序不需要全部调入内存就可以运行，这使得有限的内存运行大程序成为可能。例如有一台计算机可以产生 16 位地址，那么一个程序的地址空间范围是 0~64K。该计算机只有 32KB 的物理内存，虚拟内存技术允许该计算机运行一个 64K 大小的程序。 这需要页面置换算法来辅助 分页系统地址映射 内存管理单元（MMU）管理着地址空间和物理内存的转换，其中的页表（Page table）存储着页（程序地址空间）和页框（物理内存空间）的映射表。 一个虚拟….","articleStatus":0,"articlePermalink":"/articles/2019/04/13/1561009682385.html","articleImg1URL":"https://gitee.com/CyC2018/CS-Notes/raw/master/docs/pics/7b281b1e-0595-402b-ae35-8c91084c33c1.png"},{"articleTitle":"操作系统之磁盘","articleAbstractText":"本文采用复习拷贝重新阅读大法 本文来自该仓库 磁盘结构 盘面（Platter）：一个磁盘有多个盘面； 磁道（Track）：盘面上的圆形带状区域，一个盘面可以有多个磁道； 扇区（Track Sector）：磁道上的一个弧段，一个磁道可以有多个扇区，它是最小的物理储存单位，目前主要有 512 bytes 与 4 K 两种大小； 磁头（Head）：与盘面非常接近，能够将盘面上的磁场转换为电信号（读），或者将电信号转换为盘面的磁场（写）； 制动手臂（Actuator arm）：用于在磁道之间移动磁头； 主轴（Spindle）：使整个盘面转动。 磁盘调度算法 读写一个磁盘块的时间的影响因素有： 旋转时间（主轴转动盘面，使得磁头移动到适当的扇区上） 寻道时间（制动手臂移动，使得磁头移动到适当的磁道上） 实际的数据传输时间 其中，寻道时间最长，因此磁盘调度的主要目标是使磁盘的平均寻道时间最短。 1. 先来先服务 FCFS, First Come First Served 按照磁盘请求的顺序进行调度。 优点是公平和简单。缺点也很明显，因为未对寻道做任何优化，使平均寻道时间可能较长。 ….","articleStatus":0,"articlePermalink":"/articles/2019/04/13/1561009674101.html","articleImg1URL":"https://gitee.com/CyC2018/CS-Notes/raw/master/docs/pics/014fbc4d-d873-4a12-b160-867ddaed9807.jpg"},{"articleTitle":"操作系统概要","articleAbstractText":"本文采用复习拷贝重新阅读大法 本文来自该仓库 基本特征 1. 并发 并发是指宏观上在 一段时间 内能同时 运行多个程序，而并行则指 同一时刻 能 运行多个指令。 并行需要 硬件支持，如多流水线、多核处理器或者分布式计算系统。 操作系统通过引入 进程 和 线程，使得程序能够并发运行。 2. 共享 共享是指系统中的资源可以 被多个并发进程共同使用。 有两种共享方式：互斥共享 和 同时共享。 互斥共享的资源称为 临界资源，例如打印机等，在 同一时间只允许一个进程访问，需要用同步机制来实现对临界资源的访问。 同时共享 就是适合所有程序共同访问资源,但是应该需要访问控制,防止某一进程对资源进行了修改(我的想法) 3. 虚拟 虚拟技术把一个物理实体转换为多个逻辑实体。 主要有两种虚拟技术：时分复用技术 和 空分复用技术。 时间片轮转法 多个进程能在同一个处理器上并发执行使用了时分复用技术，让每个进程轮流占有处理器，每次只执行一小个时间片并快速切换。 虚拟内存使用了空分复用技术，它将物理内存抽象为地址空间，每个进程都有各自的地址空间。地址空间的页被映射到物理内存，地址空间的页并不需要全部在物理内….","articleStatus":0,"articlePermalink":"/articles/2019/04/07/1561009672302.html","articleImg1URL":"https://gitee.com/CyC2018/CS-Notes/raw/master/docs/pics/tGPV0.png"}]}